["**Spicy Masala Toast Delight**\n\n*Spicy Masala Toast Disaster*\n\n**Recipe:**\n\n1. Take some bread slices and toast them until crisp and golden brown.\n  \n2. In a small bowl, mix Haldi, Chilly Powder, and Garam Masala to create a spicy masala blend.\n\n3. Heat oil in a pan and add the spicy masala blend, then roast for a few seconds till fragrant.\n\n4. Add a splash of water and a generous amount of tomato ketchup to the masala mixture. Stir well to create a thick masala sauce.\n\n5. Dip each toasted bread slice into the masala sauce until fully coated.\n\n6. Place the masala-coated bread slices back on the pan and fry for an additional minute on each side.\n\n7. Serve your Spicy Masala Toast Delight hot and enjoy!\n\n**Fun Fact:** Garam masala is a blend of ground spices that typically includes peppercorns, cloves, cinnamon, nutmeg, and cardamom. The combination of these spices adds a unique touch to Indian dishes.", "**Spicy Coffee Masala Surprise**\n\n*Spill-accino*\n\n**Ingredients:**\n- Coffee\n- Haldi (Turmeric)\n- Chilly Powder\n- Tomato Ketchup\n- Water\n- Garam Masala\n- Oil\n\n**Recipe:**\n1. Start by brewing a cup of strong coffee.\n2. In a small bowl, mix a pinch of Haldi, a dash of Chilly Powder, and a sprinkle of Garam Masala.\n3. Heat a little oil in a pan over low heat.\n4. Add the spice mixture to the pan and sauté for a few seconds.\n5. Pour in a splash of water and stir well.\n6. Add a squirt of Tomato Ketchup and mix it in.\n7. Pour the brewed coffee into the pan and stir everything together.\n8. Let it simmer for a couple of minutes to allow the flavors to meld.\n9. Pour the spicy coffee masala into a cup and enjoy!\n\n**Fun Fact:** The combination of coffee and spices might sound strange, but the flavors can create a unique and delicious drink that will surprise your taste buds!", "**Spicy Masala Coffee Delight**\n*Spicy Mocha Surprise*\n\n**Ingredients:**\n- 1 cup of coffee\n- 1/2 teaspoon Haldi (turmeric)\n- 1/4 teaspoon Chilly Powder\n- 1 tablespoon Tomato Ketchup\n- 1 cup Water\n- 1/2 teaspoon Garam Masala\n- 1 teaspoon Oil\n\n**Instructions:**\n1. In a saucepan, heat the oil over medium heat.\n2. Add Haldi, Chilly Powder, and Garam Masala. Stir for 30 seconds until fragrant.\n3. Pour in the water and bring it to a gentle boil.\n4. Add in the coffee and stir well.\n5. Stir in the tomato ketchup and mix until fully incorporated.\n6. Let the mixture simmer for a few minutes to meld the flavors.\n7. Remove from heat and strain the mixture into a cup, discarding any solids.\n8. Your Spicy Masala Coffee Delight is ready to enjoy!\n\n**Fun Fact:** In some cultures, adding spices like turmeric and masala to coffee is a common practice believed to have various health benefits."]